import { Component, OnInit } from '@angular/core';
import { HttpClient } from '@angular/common/http';
import { ActivatedRoute } from '@angular/router';

@Component({
  selector: 'app-questions',
  templateUrl: './questions.component.html',
  styleUrls: ['./questions.component.css']
})
export class QuestionsComponent implements OnInit {

  questions: any;
  currentContent: string;
  currentTitle: string;

  constructor(private route: ActivatedRoute, private http: HttpClient) { }

  ngOnInit() {
    this.questions = [
      {
        title: 'Што претставува Work and Travel програмата?',
        content: 'Work and Travel претставува програма која им овозможува на студентите од целиот свет да го запознаат американскиот стил на живот, да стекнат одлично работно искуство, да заработат и да патуваат низ САД за време на нивниот 5-месечен престој. Програмата ви овозможува работна дозвола во времетраење од 4 месеци и едномесечен престој како турист. Во текот на тие 4 месеци, ќе работите на работната позиција која ќе ја изберете од тука и скоро со сигурност ќе имате можност за втора работа. Искористете го последниот месец од вашиот престој да уживате и да искусите едно поинакво секојдневие.'
      },
      {
        title: 'Дали има врска со која агенција одам?',
        content: 'Изборот на агенција е првиот чекор од целиот процес и истиот треба да биде преземен со претпазливост. Воглавно, сите агенции ги нудат истите поволности, но разликата е во квалитетот на истите. На тебе е да избереш во кое место сакаш да одиш и да ја побараш агенцијата што нуди работни понуди за таму. Распрашај се да дознаеш колку се задоволни од агенцијата тие што биле преку неа.'
      },
      {
        title: 'Што претставува спонзорот?',
        content: 'Честопати во вашите разговори со агенцијата или некој од вашите пријатели сте го слушале терминот СПОНЗОР и сте се запрашувале што значи истиот. Спонзорот е агенција која ги проследува работните понуди од работодавецот до агенцијата од Македонија која вие сте ја избрале и се грижи за вас во текот на вашиот престој во САД. Гледајте на спонзорот како посредник помеѓу вас и вашиот работодавец. Работодавецот може да се пожали на спонзорот за вашето работење, вашето однесување или вашето прекршување на дел од договорот, и притоа истиот да ви направи непосакувани проблеми. Ова е обострано, што значи дека и вие можете да се пожалите кај спонзорот за третманот кој работодавецот ви го пружа. Во случај да најдете или барате дополнителна работа, за истата мора да го известите вашиот спонзор. Спонзорот може да има канцеларија во градот каде што вие ќе се наоѓате или пак вашата комуникација да биде сведена на e-mail.'
      },
      {
        title: 'Кои фактори влијаат врз добивањето на виза?',
        content: 'Одобрувањето на визата се сведува на максимизирање на причини за твое враќање во Македонија. Треба да ги увериш претставниците од амбасадата дека ќе се вратиш дома пред истекувањето на твојата виза. Предност за добивање на виза е да бидеш солиден студент, односно да имаш положено што повеќе од предвидените предмети до тековниот зимски семестар, вклучувајќи го и него. Имањето на роднини во САД се смета за недостаток при твојата апликација, бидејќи во нивни очи, тоа ги зголемува шансите за твое останување во САД.'
      },
      {
        title: 'Колку од вложените средства се повратни во случај да не добијам виза?',
        content: 'Ќе треба да ја имаш уплатено вкупната сума од аранжманот уште пред да дознаеш дали ќе добиеш виза. Од тие средства, околу 500 долари се неповратни, од кои 200 долари од амбасадата и околу 250 долари во агенцијата, во зависност од неа. Останатите средства ќе ти бидат вратени од спонзорот во наредниот период.'
      },
      {
        title: 'Дали би можел да работам повеќе од една работа?',
        content: 'Секако дека да. Најдобро е да ја работиш примарната работа првите 2 недели за да добиеш чувство како би можел да функционираш понатака. Работните смени за втората работа мора да ти бидат секундарни, односно прилагодени според распоредот на првата работа. Секоја самостојно најдена работа мора да ја пријавиш на спонзорот.'
      },
      {
        title: 'Дали можам да ја напуштам примарната работа?',
        content: 'Во случај твојот работодавец да има волја да ти го дозволи тоа, би можел да ја напуштиш работата. Во принцип ако сакаш да дадеш отказ, работодавецот може да му се пожали на спонзорот и тие да ти направат проблем. Затоа е паметно детално да се информираш за работата за која аплицираш и работодавецот, и да избегнеш било какви понатамошни непријатности.'
      },
      {
        title: 'На кој начин ќе добивам плата?',
        content: 'Работодавецот ќе те исплаќа преку чекови, кои најчесто ќе ги добиваш на секои две недели. Оттука, се подразбира дека за првите две недели од твојот престој ќе мораш да се издржуваш со пари кои ќе треба да си ги понесеш од тука. Препорачливо е таа сума да изнесува околу 800 долари, бидејќи во тој период ќе треба да ги покриеш трошоците за кирија, храна и превоз.'
      },
      {
        title: 'Што претставува DS-2019 документот?',
        content: 'DS-2019 документот е дел од J1 визата која ја добиваш и ти дозволува да работиш во САД. Го издава твојот спонзор е задолжителен за интервјуто во амбасадата и при влез во САД. Во амбасадата се приложува заедно со останатите документи за аплицирање и истовремено се заверува.'
      }
    ];

    this.currentTitle = this.questions[0].title;
    this.currentContent = this.questions[0].content;
  }

  // ngOnInit() {
    // console.log('Questions component...');
    // this.questions = this.http.get<any>('http://localhost:3000/questions/get-questions');
  // }

  changeContent(title) {
    const result = this.questions.find(question => question.title === title);
    this.currentContent = result.content;
    this.currentTitle = result.title;
  }

}
