import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-questions',
  templateUrl: './questions.component.html',
  styleUrls: ['./questions.component.css']
})
export class QuestionsComponent implements OnInit {

  questions: any[];
  currentContent: string;
  currentTitle: string;

  constructor() { }

  ngOnInit() {
    this.questions = [
      {
        title: 'Што претставува Work and Travel програмата?',
        content: 'Work and Travel претставува програма која им овозможува на студентите од целиот свет да го запознаат американскиот стил на живот, да стекнат одлично работно искуство, да заработат и да патуваат низ САД за време на нивниот 5-месечен престој. Програмата ви овозможува работна дозвола во времетраење од 4 месеци и едномесечен престој како турист. Во текот на тие 4 месеци, ќе работите на работната позиција која ќе ја изберете од тука и скоро со сигурност ќе имате можност за втора работа. Искористете го последниот месец од вашиот престој да уживате и да искусите едно поинакво секојдневие.'
      },
      {
        title: 'Дали има врска со која агенција одам?',
        content: 'Изборот на агенција е првиот чекор од целиот процес и истиот треба да биде преземен со претпазливост. Воглавно, сите агенции ги нудат истите поволности, но разликата е во квалитетот на истите. На тебе е да избереш во кое место сакаш да одиш и да ја побараш агенцијата што нуди работни понуди за таму. Распрашај се да дознаеш колку се задоволни од агенцијата тие што биле преку неа.'
      },
      {
        title: 'Што претставува спонзорот?',
        content: 'Честопати во вашите разговори со агенцијата или некој од вашите пријатели сте го слушале терминот СПОНЗОР и сте се запрашувале што значи истиот. Спонзорот е агенција која ги проследува работните понуди од работодавецот до агенцијата од Македонија која вие сте ја избрале и се грижи за вас во текот на вашиот престој во САД. Гледајте на спонзорот како посредник помеѓу вас и вашиот работодавец. Работодавецот може да се пожали на спонзорот за вашето работење, вашето однесување или вашето прекршување на дел од договорот, и притоа истиот да ви направи непосакувани проблеми. Ова е обострано, што значи дека и вие можете да се пожалите кај спонзорот за третманот кој работодавецот ви го пружа. Во случај да најдете или барате дополнителна работа, за истата мора да го известите вашиот спонзор. Спонзорот може да има канцеларија во градот каде што вие ќе се наоѓате или пак вашата комуникација да биде сведена на e-mail.'
      },
      {
        title: 'Кои фактори влијаат врз добивањето на виза?',
        content: 'Одобрувањето на визата се сведува на максимизирање на причини за твое враќање во Македонија. Треба да ги увериш претставниците од амбасадата дека ќе се вратиш дома пред истекувањето на твојата виза. Предност за добивање на виза е да бидеш солиден студент, односно да имаш положено што повеќе од предвидените предмети до тековниот зимски семестар, вклучувајќи го и него. Имањето на роднини во САД се смета за недостаток при твојата апликација, бидејќи во нивни очи, тоа ги зголемува шансите за твое останување во САД.'
      }
    ];

    this.currentTitle = this.questions[0].title;
    this.currentContent = this.questions[0].content;
  }

  changeContent(title) {
    const result = this.questions.find(question => question.title === title);
    this.currentContent = result.content;
    this.currentTitle = result.title;
  }

}
