import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-advices',
  templateUrl: './advices.component.html',
  styleUrls: ['./advices.component.css']
})
export class AdvicesComponent implements OnInit {

  advices: any[];

  constructor() { }

  ngOnInit() {
    this.advices = [
      {
        title: 'Интервју со работодавецот',
        intro: 'Интервјуто за работа со работодавецот е составен дел од процесот за аплицирање во САД. Тоа може да биде изведено лице во лице на некој од саемите за работа што ги организира агенцијата преку која одиш, или може да биде изведено преку Skype',
        bullets: [
          'Пробај да се информираш за работодавецот. Пробај да најдеш некој кој работел кај него за да ти даде некој совет за твојот пристап.',
          'Пристапи на интервјуто релаксирано. Никој не сака да вработи нервозен и нестрплив тип.',
          'Внимателно слушајте ги прашањата кои тој ви ги поставува. Ако не си слушнал добро или не си сигурен како гласело прашањето, замоли го да го повтори истото.',
          'Пред интервјуто, внимателно избери на кој начин ќе се претставиш и кои свои способности ќе ги истакнеш.',
          'За време на интервјуто, поставувај прашања. Така ќе покажеш дека си заинтересиран за работата и ќе делуваш попрофесионално. Обиди се да добиеш што пореална слика за твоето идно работно место, бидејќи сепак наредните 4 месеци тоа ќе ти биде секојдневие.'
        ]
      },
      {
        title: 'Интервју за виза',
        intro: 'Интервјуто за виза е последниот дел од целиот процес. Тоа е настанот кој ќе одреди дали ќе добиеш работна виза за да заминеш во САД. Иако постои општоприфатено мислење дека интервјуто во амбасада е клучниот дел во твоето добивање на виза, тоа не е така. Претставниците во амбасадата ја разгледуваат твојата претходно поднесена апликација и врз основа на неа донесуваат одлука дали ти ќе добиеш виза или не. Интервјуто е само формалност за ти да ги потврдиш прашањата кои си ги одговорил во апликацијата',
        bullets: [
          'Дојди дваесетина минути пред закажаниот термин за интервјуто. Така ќе бидеш посмирен, а со тоа и поподготвен за интервјуто.',
          'За време на интервјуто, ќе треба да покажеш дека имаш солидно познавање на англискиот јазик. Ќе треба да увидат дека имаш доволно добро познавање за да можеш без проблем да ги извршуваш твоите работни обврски и да егзистираш.',
          'Треба да покажеш дека немаш никаква намера да останеш во САД по истекувањето на твојата виза и дека ќе се вратиш во Македонија по завршувањето на програмата.',
          'Детално разгледај ја работната понуда за која аплицираш за да покажеш дека си подготвен да ја исполниш својата обврска.',
          'Биди свој! Покажи ја својата волја да ја искусиш Америка и истакни ги сите фактори кои влијаеле на твојата одлука да аплицираш за програмата.',
          'За крај, биди опуштен и обиди се да гледаш на интервјуто како на само еден обичен разговор'
        ]
      },
      {
        title: 'Подготовка за патувањето',
        intro: 'Патувањето трае повеќе од 20 часа и за многумина може да биде мачно. Биди подготвен на можни компликации и менување на превозните средства и временските зони.',
        bullets: [
          'Пред да патуваш, информирај се за превозот од аеродромите во градовите кои ќе ги посетиш попатно',
          'Дознај ги најбрзите и најефтините превози, местата на кои можеш да јадеш и сл.',
          'Пробај да се одмориш пред летот',
          'Осигурај се да земеш доволно пари во случај да ти притреба нешто'
        ]
      }
    ];
  }

}
